{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_12_input"}}, {"class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "batch_input_shape": [null, 10], "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_8", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_9", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_10", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_10", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_11", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_11", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_17", "trainable": true, "dtype": "float32", "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "RMSprop", "config": {"name": "RMSprop", "learning_rate": 0.0010000000474974513, "decay": 0.0, "rho": 0.8999999761581421, "momentum": 0.0, "epsilon": 1e-07, "centered": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_12/kernel", "shape": [10, 1024], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -3.2816826128492167, "scale": 0.026253460902793735, "original_dtype": "float32"}}, {"name": "dense_12/bias", "shape": [1024], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.14032828860423144, "scale": 0.0015420691055410048, "original_dtype": "float32"}}, {"name": "dense_13/kernel", "shape": [1024, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.2096623579661052, "scale": 0.009677298863728841, "original_dtype": "float32"}}, {"name": "dense_13/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.19777292994891896, "scale": 0.0015949429834590239, "original_dtype": "float32"}}, {"name": "dense_14/kernel", "shape": [512, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.0784554986392751, "scale": 0.007489274296106077, "original_dtype": "float32"}}, {"name": "dense_14/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.25830799551571115, "scale": 0.0026907082866219913, "original_dtype": "float32"}}, {"name": "dense_15/kernel", "shape": [256, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.041245081845452, "scale": 0.008198780172011432, "original_dtype": "float32"}}, {"name": "dense_15/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3501068437800688, "scale": 0.0022442746396158257, "original_dtype": "float32"}}, {"name": "dense_16/kernel", "shape": [128, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8318318913964664, "scale": 0.007109674285439884, "original_dtype": "float32"}}, {"name": "dense_16/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3506303871379179, "scale": 0.002656290811650893, "original_dtype": "float32"}}, {"name": "dense_17/kernel", "shape": [64, 10], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -2.4280571596295224, "scale": 0.015081100370369705, "original_dtype": "float32"}}, {"name": "dense_17/bias", "shape": [10], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.6854395570123897, "scale": 0.006935965255195019, "original_dtype": "float32"}}, {"name": "layer_normalization_10/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.1623298078775406, "scale": 0.008874604690308664, "original_dtype": "float32"}}, {"name": "layer_normalization_10/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.9817614555358887, "scale": 0.007662102777291747, "original_dtype": "float32"}}, {"name": "layer_normalization_11/gamma", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.3713037371635437, "scale": 0.004676676497739904, "original_dtype": "float32"}}, {"name": "layer_normalization_11/beta", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.38578933126786175, "scale": 0.002755638080484727, "original_dtype": "float32"}}, {"name": "layer_normalization_8/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.8910412192344666, "scale": 0.004177520088121003, "original_dtype": "float32"}}, {"name": "layer_normalization_8/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.0978658246059043, "scale": 0.0052782010798360784, "original_dtype": "float32"}}, {"name": "layer_normalization_9/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.4379563629627228, "scale": 0.00803733140814538, "original_dtype": "float32"}}, {"name": "layer_normalization_9/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.284089233828526, "scale": 0.005534867387191922, "original_dtype": "float32"}}]}]}